@sfc-gh-asawicki 
Thank you for the heads-up on v0.98.0. I've tested it, and I can confirm that the snowflake_grant_privileges_to_account_role operation is now working successfully with COMPUTE POOL grants. The fix is working as expected.

```terraform
terraform {
  required_version = "1.9.8"

  required_providers {
    snowflake = {
      source  = "Snowflake-Labs/snowflake"
      version = "0.98.0"
    }
  }
}

provider "snowflake" {}

provider "snowflake" {
  alias = "accountadmin"

  role = "ACCOUNTADMIN"
}

provider "snowflake" {
  alias = "securityadmin"

  role = "SECURITYADMIN"
}

provider "snowflake" {
  alias = "useradmin"

  role = "USERADMIN"
}

resource "snowflake_unsafe_execute" "test_compute_pool" {
  provider = snowflake.accountadmin

  execute = <<SQL
CREATE COMPUTE POOL TEST_POOL
  INSTANCE_FAMILY = CPU_X64_XS
  MIN_NODES = 1
  MAX_NODES = 1
  INITIALLY_SUSPENDED = TRUE
  AUTO_SUSPEND_SECS = 3600
SQL
  revert  = "DROP COMPUTE POOL TEST_POOL"
}

resource "snowflake_account_role" "test_compute_pool_usage_access_role" {
  provider = snowflake.useradmin

  name    = "TEST_POOL_USAGE"
  comment = "Access role that has USAGE privilege on the compute pool TEST_POOL"
}

resource "snowflake_grant_privileges_to_account_role" "grant_usage_privilege_to_test_compute_pool_usage_access_role" {
  depends_on = [snowflake_unsafe_execute.test_compute_pool]
  provider   = snowflake.securityadmin

  account_role_name = snowflake_account_role.test_compute_pool_usage_access_role.name
  privileges        = ["USAGE"]

  on_account_object {
    object_type = "COMPUTE POOL"
    object_name = "TEST_POOL"
  }
}
```

```console
...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_account_role.test_compute_pool_usage_access_role will be created
  + resource "snowflake_account_role" "test_compute_pool_usage_access_role" {
      + comment              = "Access role that has USAGE privilege on the compute pool TEST_POOL"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "TEST_POOL_USAGE"
      + show_output          = (known after apply)
    }

  # snowflake_grant_privileges_to_account_role.grant_usage_privilege_to_test_compute_pool_usage_access_role will be created
  + resource "snowflake_grant_privileges_to_account_role" "grant_usage_privilege_to_test_compute_pool_usage_access_role" {
      + account_role_name = "TEST_POOL_USAGE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "USAGE",
        ]
      + with_grant_option = false

      + on_account_object {
          + object_name = "TEST_POOL"
          + object_type = "COMPUTE POOL"
        }
    }

  # snowflake_unsafe_execute.test_compute_pool will be created
  + resource "snowflake_unsafe_execute" "test_compute_pool" {
      + execute       = <<-EOT
            CREATE COMPUTE POOL TEST_POOL
              INSTANCE_FAMILY = CPU_X64_XS
              MIN_NODES = 1
              MAX_NODES = 1
              INITIALLY_SUSPENDED = TRUE
              AUTO_SUSPEND_SECS = 3600
        EOT
      + id            = (known after apply)
      + query_results = (known after apply)
      + revert        = "DROP COMPUTE POOL TEST_POOL"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

snowflake_account_role.test_compute_pool_usage_access_role: Creating...
snowflake_account_role.test_compute_pool_usage_access_role: Creation complete after 0s [id=TEST_POOL_USAGE]
snowflake_unsafe_execute.test_compute_pool: Creating...
snowflake_unsafe_execute.test_compute_pool: Creation complete after 0s [id=5707da03-5296-3ce8-7c79-6c6292b0f719]
snowflake_grant_privileges_to_account_role.grant_usage_privilege_to_test_compute_pool_usage_access_role: Creating...
snowflake_grant_privileges_to_account_role.grant_usage_privilege_to_test_compute_pool_usage_access_role: Creation complete after 0s [id="TEST_POOL_USAGE"|false|false|USAGE|OnAccountObject|COMPUTE POOL|"TEST_POOL"]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```